maze.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>maze</title>
<!-- 2015-09-19 Sat 23:51 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="n-chaos" />
</head>
<body>
<div id="content">
<h1 class="title">maze</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Requirements</a></li>
<li><a href="#sec-2">2. Domain-Nouns-for-Model</a></li>
<li><a href="#sec-3">3. Usecases</a>
<ul>
<li><a href="#sec-3-1">3.1. usecase-template: synopsis</a></li>
<li><a href="#sec-3-2">3.2. usecase: user starts game</a></li>
<li><a href="#sec-3-3">3.3. usecase: user sets up game</a></li>
<li><a href="#sec-3-4">3.4. usecase: player moves to goal</a></li>
<li><a href="#sec-3-5">3.5. usecase: monster kills player</a></li>
<li><a href="#sec-3-6">3.6. usecase: player falls into pit</a></li>
<li><a href="#sec-3-7">3.7. usecase: player killed by arrow</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Design:</a></li>
<li><a href="#sec-5">5. dirs</a></li>
<li><a href="#sec-6">6. grid</a></li>
<li><a href="#sec-7">7. uml</a></li>
<li><a href="#sec-8">8. cookbook</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Requirements</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>terminal interface depicting a player in a maze trying to get to a goal
</li>

<li>player attempts to evade the evil monsters and get to the goal
</li>

<li>mazes are created randomly with a level of hardness associated with the players current level in the game
</li>

<li>player can answer descrete math questions about number theory in order to traverse multiple moves in a single turn.
</li>

<li>player chooses monster path finding algorithm
</li>
<li>monsters can be kill only player or kill everyone
</li>
<li>player can get decoys from hidden keys , decoys will overide monster pathfinding making them loose their path to player.
</li>
<li>pits can  open up during game at random interval and swallow anything (player, monster, dancing bears).
</li>
<li>bent arrows are shot from arrow walls with random bendability ( bendability == number of curves they can make to sustain flight) .
</li>
<li>search algorithms for graphs should be used for monster maze killers
<ul class="org-ul">
<li>a-star
</li>
<li>djykstras algorithm 
</li>
<li>depth first 
</li>
<li>breadth first
</li>
</ul>
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Domain-Nouns-for-Model</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>player
</li>
<li>maze
</li>
<li>terminal
</li>
<li>search algorithm
</li>
<li>boobytrap
<ul class="org-ul">
<li>pit
</li>
<li>arrow
</li>
</ul>
</li>
<li>wall
</li>
<li>goal
</li>
<li>level
</li>
<li>monster
</li>
<li>interval
</li>
<li>dancing bear
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Usecases</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> usecase-template: synopsis</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>actor         :  
</li>
<li>pre-action    : 
</li>
<li>sunny day     :
</li>
<li>rainy day     :
</li>
<li>postcondition : 
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> usecase: user starts game</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>actor         : user
</li>
<li>pre-action    : game isn't running 
</li>
<li>sunny day     : player starts game, picks a monster algorithm, picks a level of hardness, and presses (begin). a maze appears with a player and a goal. and monsters and booby traps . 
</li>
<li>rainy day     : player starts game, something goes wrong . player is given the option to let the game crash and restart or try to continue. suggested actions for different error are given if the (kill) option is chosen.
</li>
<li>postcondition : a maze is created and added to the maze database for quick retrieaval. a game with stats is stored in the db also for later. 
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> usecase: user sets up game</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>actor         : user 
</li>
<li>pre-action    : system display "Setup" screen 
</li>
<li>sunny day     : user enters: 
<ul class="org-ul">
<li>(MSA) monster search algorithm
</li>
<li>(VS) verbose search
</li>
<li>(HL) hardness level
</li>
<li>(MNR) monster number range
</li>
</ul>
<p>
System verifies input 
</p>
</li>

<li>rainy day     : user enters incorrect data, 
System restarts at "Setup" screen with warning 
</li>

<li>postcondition : System loads a game session,
System shows "Lets Play" screen 
Game starts
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> usecase: player moves to goal</h3>
<div class="outline-text-3" id="text-3-4">
<p>
actor         : user
pre-action    : System displays "Lets play" screen, then maze appears
sunny day     : user guides player up/down/left/right through maze
                player reaches goal 
                System verifies player and goal are at same position
rainy day     : Player moves to wall and repeatedly hits 
                After n-tries system ends the game
                Maze restarts from beginning 
</p>

<p>
postcondition : System shows "Congratulations" screen 
                System starts next maze 
</p>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> usecase: monster kills player</h3>
<div class="outline-text-3" id="text-3-5">
<p>
actor         :  monster (system bot)
pre-action    : Player moves on screen
sunny day     : Monster moves to players position
                System verifies player and monster are at same position
rainy day     :
postcondition : System shows "You're dead" screen
                System shows "Restart" screen with 3 options 
</p>
<ul class="org-ul">
<li>replay same maze
</li>
<li>get new maze
</li>
<li>quit
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> usecase: player falls into pit</h3>
<div class="outline-text-3" id="text-3-6">
<p>
actor         :  
pre-action    : 
sunny day     :
rainy day     :
postcondition : 
</p>
</div>
</div>

<div id="outline-container-sec-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> usecase: player killed by arrow</h3>
<div class="outline-text-3" id="text-3-7">
<p>
actor         :  
pre-action    : 
sunny day     :
rainy day     :
postcondition : 
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Design:</h2>
<div class="outline-text-2" id="text-4">
<p>
4 windows 
</p>

<p>
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% instructs  %                                              %
%    &amp;       %                 maze                         %
% stats      %                 proper                       %
%            %                                              %
%            %                                              % 
%            %                                              % 
</p>
<ul class="org-ul">
<li>+                                              +
</li>
</ul>
<p>
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%          info about the game or error messages            %
%                                                           %
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
</p>

<p>
menu<sub>win</sub> = window for instructions and stats
</p>

<p>
maze = window for the maze 
</p>

<p>
info = window for error messages or other 
</p>

<p>
stdscr = standard screen made by default 
</p>
</div>
</div>




<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> dirs</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>algors
<ul class="org-ul">
<li>pathfinding
</li>
</ul>
</li>
<li>test
<ul class="org-ul">
<li>unit tests 
</li>
</ul>
</li>
<li>interface
<ul class="org-ul">
<li>ncurses representation for the grid
</li>
</ul>
</li>
<li>grid 
<ul class="org-ul">
<li>grid.h
</li>
</ul>
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> grid</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>grid.h  2 d representation for maze 
{ [ 0,0,0,0],
  [ 1,1,1,0],
  [ 0,0,1,0],
  [ 1,0,0,0] } 

<p>
int coordTest(y,x);
int setWall(y,x);
int clearWall(y,x);
</p>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> uml</h2>
<div class="outline-text-2" id="text-7">
<p>
title Register as User &lt;roa&gt;
note right: <a id="precondition" name="precondition"></a> &#x2013; \n<a id="postcondition" name="postcondition"></a> user credentials stored
(*) &#x2013;&gt;  "<a id="UA" name="UA"></a>\nSelect 'register' option"
  note right: <a id="scene" name="scene"></a>\n<a id="button/link" name="button/link"></a>\nregister
  &#x2013;&gt; "<a id="UA" name="UA"></a>\nSubmit entered credentials"
  note right: <a id="scene" name="scene"></a>\n<a id="input-attributes" name="input-attributes"></a>\n username, email\n<a id="button/link" name="button/link"></a>\nsubmit
  if "credentials valid?                                   " then
  &#x2013;&gt; [  true]  (*)
else
  &#x2014;&gt; [  false] "<a id="UA" name="UA"></a>\nSubmit entered credentials"
endif
</p>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> cookbook</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: n-chaos</p>
<p class="date">Created: 2015-09-19 Sat 23:51</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
